In [2]:
import pandas as pd
import numpy as np

# Read CSV file
df = pd.read_csv('employee.csv')

# Display all rows
#print(df)
print(df)

   emp_id         name  age  department         designation   salary  \
0     101  Amit Sharma   28          IT   Software Engineer  55000.0
1     102   Riya Verma   32          HR          HR Manager  60000.0
2     103  Rahul Mehta   28          IT   Backend Developer      NaN
3     104   Sneha Iyer   35     Finance          Accountant  65000.0
4     105  Arjun Singh   27       Sales     Sales Executive  45000.0
5     106   Neha Gupta   38          IT  Frontend Developer  52000.0
6     107   Vikram Rao   38  Operations  Operations Manager  72000.0
7     108   Pooja Nair   27          HR        HR Executive  42000.0

   experience       city
0           4  Bangalore
1           8      Delhi
2           3       Pune
3          10    Chennai
4           5     Mumbai
5           6  Bangalore
6          14  Hyderabad
7           2      Kochi

In [2]:
print(df.shape)
df.info()

(8, 8)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   emp_id       8 non-null      int64
 1   name         8 non-null      object
 2   age          8 non-null      int64
 3   department   8 non-null      object
 4   designation  8 non-null      object
 5   salary       7 non-null      float64
 6   experience   8 non-null      int64
 7   city         8 non-null      object
dtypes: float64(1), int64(3), object(4)
memory usage: 644.0+ bytes

In [3]:
df.describe()

          emp_id        age        salary  experience
count    8.00000   8.000000      7.000000        8.00
mean   104.50000  30.750000  55857.142857        6.50
std      2.44949   4.131759  10699.354676        4.00
min    101.00000  26.000000  42000.000000        2.00
25%    102.75000  27.750000  48500.000000        3.75
50%    104.50000  30.000000  55000.000000        5.50
75%    106.25000  32.750000  62500.000000        8.50
max    108.00000  38.000000  72000.000000       14.00

In [4]:
print(df[["salary","designation"]])

    salary         designation
0  55000.0   Software Engineer
1  60000.0          HR Manager
2      NaN   Backend Developer
3  65000.0          Accountant
4  45000.0     Sales Executive
5  52000.0  Frontend Developer
6  72000.0  Operations Manager
7  42000.0        HR Executive

In [11]:
df[df['salary'] > 50000].shape[0]

5

In [14]:
df[(df['salary'] > 50000) & (df['department'] == 'IT')]

,emp_id,name,age,department,designation,salary,experience,city
0,101,Amit Sharma,28,IT,Software Engineer,55000.0,4,Bangalore
5,106,Neha Gupta,31,IT,Frontend Developer,52000.0,6,Bangalore

In [16]:
df[df['salary']==df['salary'].max()]

,emp_id,name,age,department,designation,salary,experience,city
6,107,Vikram Rao,38,Operations,Operations Manager,72000.0,14,Hyderabad

In [9]:
df[df['designation'] == 'Backend Developer']

,emp_id,name,age,department,designation,salary,experience,city
2,103,Rahul Mehta,26,IT,Backend Developer,NaN,3,Pune

In [18]:
df[df['salary']==df['salary'].min()]

,emp_id,name,age,department,designation,salary,experience,city
7,108,Pooja Nair,27,HR,HR Executive,42000.0,2,Kochi

In [23]:
df_sorted=df.sort_values(by='salary',ascending=False)
df_sorted

,emp_id,name,age,department,designation,salary,experience,city
6,107,Vikram Rao,38,Operations,Operations Manager,72000.0,14,Hyderabad
3,104,Sneha Iyer,35,Finance,Accountant,65000.0,10,Chennai
1,102,Riya Verma,32,HR,HR Manager,60000.0,8,Delhi
0,101,Amit Sharma,28,IT,Software Engineer,55000.0,4,Bangalore
5,106,Neha Gupta,31,IT,Frontend Developer,52000.0,6,Bangalore
4,105,Arjun Singh,29,Sales,Sales Executive,45000.0,5,Mumbai
7,108,Pooja Nair,27,HR,HR Executive,42000.0,2,Kochi
2,103,Rahul Mehta,26,IT,Backend Developer,NaN,3,Pune

In [24]:
df['city'].value_counts()

city
Bangalore    2
Delhi        1
Pune         1
Chennai      1
Mumbai       1
Hyderabad    1
Kochi        1
Name: count, dtype: int64

In [25]:
df.groupby('city').size()

city
Bangalore    2
Chennai      1
Delhi        1
Hyderabad    1
Kochi        1
Mumbai       1
Pune         1
dtype: int64

In [27]:
df[df['salary'].isnull()]

,emp_id,name,age,department,designation,salary,experience,city
2,103,Rahul Mehta,26,IT,Backend Developer,NaN,3,Pune

In [31]:
average_salary = df['salary'].mean()
df['salary'] = df['salary'].fillna(average_salary)
print(df)

   emp_id         name  age  department         designation        salary  \
0     101  Amit Sharma   28          IT   Software Engineer  55000.000000
1     102   Riya Verma   32          HR          HR Manager  60000.000000
2     103  Rahul Mehta   26          IT   Backend Developer  55857.142857
3     104   Sneha Iyer   35     Finance          Accountant  65000.000000
4     105  Arjun Singh   29       Sales     Sales Executive  45000.000000
5     106   Neha Gupta   31          IT  Frontend Developer  52000.000000
6     107   Vikram Rao   38  Operations  Operations Manager  72000.000000
7     108   Pooja Nair   27          HR        HR Executive  42000.000000

   experience       city
0           4  Bangalore
1           8      Delhi
2           3       Pune
3          10    Chennai
4           5     Mumbai
5           6  Bangalore
6          14  Hyderabad
7           2      Kochi

In [33]:
df.to_csv("updated_employees.csv", index=False)

In [35]:
df['bonus'] = df['salary'] * 0.10
print(df)

   emp_id         name  age  department         designation        salary  \
0     101  Amit Sharma   28          IT   Software Engineer  55000.000000
1     102   Riya Verma   32          HR          HR Manager  60000.000000
2     103  Rahul Mehta   26          IT   Backend Developer  55857.142857
3     104   Sneha Iyer   35     Finance          Accountant  65000.000000
4     105  Arjun Singh   29       Sales     Sales Executive  45000.000000
5     106   Neha Gupta   31          IT  Frontend Developer  52000.000000
6     107   Vikram Rao   38  Operations  Operations Manager  72000.000000
7     108   Pooja Nair   27          HR        HR Executive  42000.000000

   experience       city        bonus
0           4  Bangalore  5500.000000
1           8      Delhi  6000.000000
2           3       Pune  5585.714286
3          10    Chennai  6500.000000
4           5     Mumbai  4500.000000
5           6  Bangalore  5200.000000
6          14  Hyderabad  7200.000000
7           2      Kochi  4200.000000

In [36]:
df=df.drop(columns=['bonus'])
print(df)

   emp_id         name  age  department         designation        salary  \
0     101  Amit Sharma   28          IT   Software Engineer  55000.000000
1     102   Riya Verma   32          HR          HR Manager  60000.000000
2     103  Rahul Mehta   26          IT   Backend Developer  55857.142857
3     104   Sneha Iyer   35     Finance          Accountant  65000.000000
4     105  Arjun Singh   29       Sales     Sales Executive  45000.000000
5     106   Neha Gupta   31          IT  Frontend Developer  52000.000000
6     107   Vikram Rao   38  Operations  Operations Manager  72000.000000
7     108   Pooja Nair   27          HR        HR Executive  42000.000000

   experience       city
0           4  Bangalore
1           8      Delhi
2           3       Pune
3          10    Chennai
4           5     Mumbai
5           6  Bangalore
6          14  Hyderabad
7           2      Kochi

In [41]:

def apply_hike(row):
    if row['department'] == 'IT':
        return row['salary'] * 1.10
    elif row['department'] == 'HR':
        return row['salary'] * 1.05
    else:
        return row['salary']
df['new_salary'] = df.apply(apply_hike, axis=1)
print(df)

   emp_id         name  age  department         designation        salary  \
0     101  Amit Sharma   28          IT   Software Engineer  55000.000000
1     102   Riya Verma   32          HR          HR Manager  60000.000000
2     103  Rahul Mehta   26          IT   Backend Developer  55857.142857
3     104   Sneha Iyer   35     Finance          Accountant  65000.000000
4     105  Arjun Singh   29       Sales     Sales Executive  45000.000000
5     106   Neha Gupta   31          IT  Frontend Developer  52000.000000
6     107   Vikram Rao   38  Operations  Operations Manager  72000.000000
7     108   Pooja Nair   27          HR        HR Executive  42000.000000

   experience       city    new_salary
0           4  Bangalore  60500.000000
1           8      Delhi  63000.000000
2           3       Pune  61442.857143
3          10    Chennai  65000.000000
4           5     Mumbai  45000.000000
5           6  Bangalore  57200.000000
6          14  Hyderabad  72000.000000
7           2      Kochi  44100.000000

In [42]:
df['updated_salary']=df['salary']
df.loc[df['department'] == 'HR', 'updated_salary'] *= 1.05

In [49]:
df['department']=df['department'].replace("HR",1)
df['department']=df['department'].replace("IT",2)
df['department']=df['department'].replace("Finance",3)
df['department']=df['department'].replace("Sales",4)
df['department']=df['department'].replace("Operations",5)
df.to_csv("updated_employees.csv", index=False)

print(df)

   emp_id         name  age  department         designation        salary  \
0     101  Amit Sharma   28           2   Software Engineer  55000.000000
1     102   Riya Verma   32           1          HR Manager  60000.000000
2     103  Rahul Mehta   26           2   Backend Developer  55857.142857
3     104   Sneha Iyer   35           3          Accountant  65000.000000
4     105  Arjun Singh   29           4     Sales Executive  45000.000000
5     106   Neha Gupta   31           2  Frontend Developer  52000.000000
6     107   Vikram Rao   38           5  Operations Manager  72000.000000
7     108   Pooja Nair   27           1        HR Executive  42000.000000

   experience       city    new_salary  updated_salary
0           4  Bangalore  60500.000000    55000.000000
1           8      Delhi  63000.000000    63000.000000
2           3       Pune  61442.857143    55857.142857
3          10    Chennai  65000.000000    65000.000000
4           5     Mumbai  45000.000000    45000.000000
5           6  Bangalore  57200.000000    52000.000000
6          14  Hyderabad  72000.000000    72000.000000
7           2      Kochi  44100.000000    44100.000000

In [3]:

df_emp = pd.read_csv('updated_employees.csv')

df_dept = pd.read_csv('department.csv')

merged_df = pd.merge(df_emp, df_dept, on='dept_id', how='inner')

merged_df = merged_df[['emp_id', 'name', 'age', 'dept_id', 'dept_name']]

merged_df.to_csv('merged_employee_dept.csv', index=False)

print(merged_df.head())

   emp_id         name  age  dept_id dept_name
0     101  Amit Sharma   28        2        HR
1     102   Riya Verma   32        1        IT
2     103  Rahul Mehta   26        2        HR
3     104   Sneha Iyer   35        3   Finance
4     105  Arjun Singh   29        4     Sales

In [59]:
dept_count = merged_df.groupby('dept_name').size()
print(dept_count)

dept_name
Finance       1
HR            3
IT            2
Operations    1
Sales         1
dtype: int64